docs/posts/2016-08-07-a-wedding-prayer-and-blessing.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Wedding Prayer and Blessing</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A Wedding Prayer and Blessing</h1>
<p class="subtitle" role="doc-subtitle">Aug 07, 2016</p>
</header><p>
I officiated a wedding for a former student and dear friend yesterday. Here is the prayer and blessing from the ceremony:
</p>

<p>
God of grace, hear our prayer,
</p>

<p>
We give thanks for this day, for we need it desperately.<br>
The world inundates us with messages of<br>
helplessness and hopelessness, emptiness and despair,<br>
until we are tempted to feel that all is lost.<br>
</p>

<p>
Then we come to this place,<br>
and we find that there is still hope,<br>
for the love that spoke the world into being<br>
has drawn these two people together,<br>
so that they may create their own world,<br>
a life together,<br>
marked by beauty,<br>
dedicated to peace,<br>
and surrounded by love.
</p>

<p>
Protect, guide, and bless them in their marriage.<br>
Surround us all with your love, now and always.
</p>

<p>
Now, may the slanting rays of the sun<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup><br>
light the path before you,<br>
as the love of God surrounds you,<br>
to guide you on this journey together.<br>
May God guard your hearts<br>
from anything that might separate you,<br>
and shelter you in his love, forever.
</p>

<p>
<i>Amen</i>
</p>

<div class="tagline" id="org28e2f74">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For those who haven&rsquo;t taken my existentialism course, &ldquo;the slanting rays of the sun&rdquo; is a metaphorical image that Dostoevsky uses in <i>The Brothers Karamazov</i>.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
